"""
2019.11.09 23:40
字符串切片
2345
23456789
012345
0123456789
02468
13579
2345678
89
9876543210
"""

num_str = "0123456789"

# 1. 截取从 2~5 位置的字符串
print(num_str[2:6])

# 2. 截取从 2~末尾 的字符串
print(num_str[2:])

# 3. 截取从 开始~5 位置的字符串
print(num_str[:6])

# 4. 截取完整的字符串
print(num_str[:])

# 5. 从开始位置，每隔一个字符截取字符串
print(num_str[::2])

# 6. 从 索引1 开始，每隔一个截取一个
print(num_str[1::2])

# 7. 截取从 2~末尾-1 的字符串
print(num_str[2:-1])

# 8. 截取字符串末尾两个字符
print(num_str[-2:])

# 9. 字符串的逆序（面试题）
# print(num_str[-1::-1])
print(num_str[::-1])
